In [ ]:
# hypothisis assignments

# # Q1 (1 st ppt answer )

In [7]:
import pandas as pd 
import numpy as np
from scipy import stats
from scipy.stats import norm
from scipy.stats import norm
from scipy.stats import chi2_contingency

In [2]:
data=pd.read_csv("Cutlets.csv")
data

    Unit A  Unit B
0   6.8090  6.7703
1   6.4376  7.5093
2   6.9157  6.7300
3   7.3012  6.7878
4   7.4488  7.1522
5   7.3871  6.8110
6   6.8755  7.2212
7   7.0621  6.6606
8   6.6840  7.2402
9   6.8236  7.0503
10  7.3930  6.8810
11  7.5169  7.4059
12  6.9246  6.7652
13  6.9256  6.0380
14  6.5797  7.1581
15  6.8394  7.0240
16  6.5970  6.6672
17  7.2705  7.4314
18  7.2828  7.3070
19  7.3495  6.7478
20  6.9438  6.8889
21  7.1560  7.4220
22  6.5341  6.5217
23  7.2854  7.1688
24  6.9952  6.7594
25  6.8568  6.9399
26  7.2163  7.0133
27  6.6801  6.9182
28  6.9431  6.3346
29  7.0852  7.5459
30  6.7794  7.0992
31  7.2783  7.1180
32  7.1561  6.6965
33  7.3943  6.5780
34  6.9405  7.3875

In [3]:
data.head()

   Unit A  Unit B
0  6.8090  6.7703
1  6.4376  7.5093
2  6.9157  6.7300
3  7.3012  6.7878
4  7.4488  7.1522

In [8]:
sampleA=pd.Series(data.iloc[ : ,0])
sampleA

0     6.8090
1     6.4376
2     6.9157
3     7.3012
4     7.4488
5     7.3871
6     6.8755
7     7.0621
8     6.6840
9     6.8236
10    7.3930
11    7.5169
12    6.9246
13    6.9256
14    6.5797
15    6.8394
16    6.5970
17    7.2705
18    7.2828
19    7.3495
20    6.9438
21    7.1560
22    6.5341
23    7.2854
24    6.9952
25    6.8568
26    7.2163
27    6.6801
28    6.9431
29    7.0852
30    6.7794
31    7.2783
32    7.1561
33    7.3943
34    6.9405
Name: Unit A, dtype: float64

In [9]:
sampleB=pd.Series(data.iloc[ : ,1])
sampleB

0     6.7703
1     7.5093
2     6.7300
3     6.7878
4     7.1522
5     6.8110
6     7.2212
7     6.6606
8     7.2402
9     7.0503
10    6.8810
11    7.4059
12    6.7652
13    6.0380
14    7.1581
15    7.0240
16    6.6672
17    7.4314
18    7.3070
19    6.7478
20    6.8889
21    7.4220
22    6.5217
23    7.1688
24    6.7594
25    6.9399
26    7.0133
27    6.9182
28    6.3346
29    7.5459
30    7.0992
31    7.1180
32    6.6965
33    6.5780
34    7.3875
Name: Unit B, dtype: float64

In [10]:
# we have sample that why we used t test
# and find the p value

p_value=stats.ttest_ind(sampleA,sampleB)
p_value

Ttest_indResult(statistic=0.7228688704678063, pvalue=0.47223947245995)

In [12]:
p_value[1]

0.47223947245995

In [ ]:
# now compare the p_value with alfa=0.05 (at 5% significient leve

In [ ]:
# (p_value=0.4722)>(α=0.05)
# there is null hupothisis is happen  μ1 = μ2 
# there is no diffrence betwen diameter in the cutlets

#  Q2 (2 nd ppt answer )

In [3]:
# import the file
data=pd.read_csv("LabTAT.csv")
data

     Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0          185.35        165.53        176.70        166.13
1          170.49        185.91        198.45        160.79
2          192.77        194.92        201.23        185.18
3          177.33        183.00        199.61        176.42
4          193.41        169.57        204.63        152.60
..            ...           ...           ...           ...
115        178.49        170.66        193.80        172.68
116        176.08        183.98        215.25        177.64
117        202.48        174.54        203.99        170.27
118        182.40        197.18        194.52        150.87
119        182.09        215.17        221.49        162.21

[120 rows x 4 columns]

In [ ]:
# here we performing the annova test

In [5]:
p_value=stats.f_oneway(data.iloc[ : ,0],data.iloc[ : ,1] ,data.iloc[ : ,3])
p_value

F_onewayResult(statistic=42.9642878605358, pvalue=1.9085834249466044e-17)

In [ ]:
# hece the (p-value=0)<(α = 0.05) here,
# reject the null hypothisis 
# there is diffrence between the in avg TAT of the report of the laboratories.

# Q3 (3rd ppt)

In [3]:
data = pd.read_csv("BuyerRatio.csv")
data

  Observed Values  East  West  North  South
0           Males    50   142    131     70
1         Females   435  1523   1356    750

In [ ]:
# null hypothis is that male female buyers rations are similer across regions
# alternate hypothisis is that male femalebuyer rations are not similer across gains

In [12]:
df = data.iloc[ : ,1:]
df

   East  West  North  South
0    50   142    131     70
1   435  1523   1356    750

In [13]:
p_value=chi2_contingency(df)
p_value[1]

0.6603094907091882

In [14]:
# p value with α = 0.05
#As (p-value = 0.6603) > (α = 0.05) Accept the Null Hypothesis

#Thus, male-female buyer rations are similar across regions.

# Q4 (ppt 4)

In [15]:
data=pd.read_csv("Costomer+OrderForm.csv")
data

    Phillippines   Indonesia       Malta       India
0     Error Free  Error Free   Defective  Error Free
1     Error Free  Error Free  Error Free   Defective
2     Error Free   Defective   Defective  Error Free
3     Error Free  Error Free  Error Free  Error Free
4     Error Free  Error Free   Defective  Error Free
..           ...         ...         ...         ...
295   Error Free  Error Free  Error Free  Error Free
296   Error Free  Error Free  Error Free  Error Free
297   Error Free  Error Free   Defective  Error Free
298   Error Free  Error Free  Error Free  Error Free
299   Error Free   Defective   Defective  Error Free

[300 rows x 4 columns]

In [17]:
Phillippines=data.Phillippines.value_counts()
Phillippines_Error_Free=Phillippines[0]
Phillippines_Defective=Phillippines[1]

In [19]:
Indonesia=data.Indonesia.value_counts()
Indonesia_Error_Free=Indonesia[0]
Indonesia_Defective=Indonesia[1]

In [20]:
Malta=data.Malta.value_counts()
PMalta_Error_Free=Malta[0]
Malta_Defective=Malta[1]

In [21]:
India=data.India.value_counts()
India_Error_Free=Phillippines[0]
India_Defective=Phillippines[1]

In [22]:
df=[[Phillippines_Error_Free,Indonesia_Error_Free,PMalta_Error_Free,India_Error_Free],
    [Phillippines_Defective,Indonesia_Defective,Malta_Defective,India_Defective]]

In [23]:
df

[[271, 267, 269, 271], [29, 33, 31, 29]]

In [25]:
p_value=chi2_contingency(df)
p_value[1]

0.9399382332004798

In [ ]:
# here ,(p_value = 0.2771) > (α = 0.05) 
# accept the null hypothisis thus, the customer order forms defective % not varies by center